<a href="https://colab.research.google.com/github/GENNYB7/TitanicData/blob/main/TitanicData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [10]:
import pandas as pd
filename = '/content/drive/MyDrive/Coding_Dojo/PandasForDataManipulation/titanic.csv'
titanic_df = pd.read_csv(filename)
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic_df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
died_number = 549
survived_number = 342
avg = (died_number + survived_number) / 2
print(avg)

445.5

In [ ]:
titanic_df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [4]:
male_number = 577
female_number = 314
male_filter = titanic_df['Sex']== 'male'
male_filter.head()

0     True
1    False
2    False
3    False
4     True
Name: Sex, dtype: bool

In [5]:
female_filter = titanic_df['Sex']== 'female'
female_filter.head()

0    False
1     True
2     True
3     True
4    False
Name: Sex, dtype: bool

In [6]:
survived_filter = titanic_df['Survived']!= 0
survived_filter.head()

0    False
1     True
2     True
3     True
4    False
Name: Survived, dtype: bool

In [13]:
(titanic_df.groupby('Survived').size()/titanic_df['Survived'].count())*100

Survived
0    61.616162
1    38.383838
dtype: float64

In [17]:
(titanic_df.groupby(['Sex', 'Survived']).size())

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
dtype: int64

In [18]:
(titanic_df.groupby('Sex').size()/titanic_df['Survived'].count())*100

Sex
female    35.241302
male      64.758698
dtype: float64